// 9. Написать функцию mergeArrays(array1, array2) слияния двух отсортированных массивов.
// Принимает 3 аргумента: 2 обязательных - массивы, 1 необязательный - тип сортировки
// Тип сортировки может быть или asc (по возрастанию), или desc (по убыванию)
// По умолчанию сортировка по возрастанию

function mergeArrays(array1, array2, sortType) {
    let resultArray = []


    resultArray = Array.from(new Set([...array1, ...array2]))

    resultArray.sort((a, b) => a - b)

    return resultArray
}
// // -> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// //
// //
console.log(mergeArrays([1, 3, 5, 7, 9],[10, 8, 6, 4, 2]))
// // -> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// //
// console.log(mergeArrays([1, 3, 5, 7, 9], [10, 8, 6, 4, 2], 'asc'))
// // -> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// //
// console.log(mergeArrays([1, 3, 5, 7, 9], [10, 8, 6, 4, 2], 'desc'))
// -> [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
//
//
// mergeArrays([1, 3, 5, 7, 9, 11, 12], [1, 2, 3, 4, 5, 10, 12])
// -> [1, 2, 3, 4, 5, 7, 9, 10, 11, 12]
//
// mergeArrays([1, 3, 5, 7, 9, 11, 12], [1, 2, 3, 4, 5, 10, 12], 'desc')
// -> [12, 11, 10, 9, 7, 5, 4, 3, 2, 1]